1. VO는 무엇이며 언제 사용하는가?

자바빈의 일종으로 값 객체로서 데이터베이스 DML에 대응되는 CRUD 메서드들의 모듈인 DAO,직렬화(객체의 내용을 파일 스트리으로 만듦)등에서
데이터 유출입시 값을 일시적으로 보유하도록 사용하는 객체.
보통 일반적으로 필드는 보안(직접 접근 방지)을 위해 private 접근 제어자를 활용하는 경우가 많고
외부 접근시 필드들에 대한 getter/setter 메서드를 주로 활용합니다. lombok 등의 유틸리티를 사용하면
애너테이션 표기만으로 각종 관련 메서드들을 자동 생성해주는 기능을 활용할 수 있다.

2. 관련 질문) getter/setter는 무엇인가?

VO나 DTO(TO)등의 자바빈 객체에서 멤버 필드에 대해 멤버 필드의 직접 접근을 막고 멤버 필드들을 
가공할 구문을 삽입하고자 사용하는 필드별로 구성된 메서드. set으로 시작하여 주로 멤버 필드값
가공 및 설정 역할을 하는 것이 setter(Set method)이며 외부에 멤버 필드값을 그대로 혹은 가공하여
내보낼 때(리턴) 사용하는 get으로 시작하는 메서드가 getter다.


3. 관련 질문) toString 오버라이딩은 왜 쓰는가?
자바빈 객체의 멤버 필드들의 현황을 한꺼번에 확인하고자 할 때 객체를 직접 인쇄(로깅:logging)하게 
되면 자동적으로 toString이 호출되게 되어 코드량을 절약할 수 있고 간편하기 때문에
보통 오버라이딩하여 많이 사용한다.

4. 관련 질문) hashCode, equals를 오버라이딩하는 이유는?
원래는 각각 객체 고유값을 인쇄하거나 객체 고유값이 같은지를 역할을 하지만 오버라이딩하여 본래
목적과는 다르게 두 자바빈 객체 간의 자바빈 멤버 필드들을 일일이 확인하는 번거로움을 덜기 위해
사용할 수 있다. 멤버 필드들의 값이 하나라도 다르면 hashCode 값이 다르게 나오고 equalss도
false가 리턴되지만 모두 같으면 각각 같은 해쉬 코드 값이 출력되고 true가 리턴된다.
